codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efh064.h
#define _USBIENCSR1_DMAREQMD_POSITION            0x0000001B
#define _USBIENCSR1_DMAREQMD_MASK                0x08000000
#define _USBIENCSR1_DMAREQMD_LENGTH              0x00000001

#define _USBIENCSR1_PIDERR_POSITION              0x0000001C
#define _USBIENCSR1_PIDERR_MASK                  0x10000000
#define _USBIENCSR1_PIDERR_LENGTH                0x00000001

#define _USBIENCSR1_DMAREQEN_POSITION            0x0000001D
#define _USBIENCSR1_DMAREQEN_MASK                0x20000000
#define _USBIENCSR1_DMAREQEN_LENGTH              0x00000001

#define _USBIENCSR1_AUTORQ_POSITION              0x0000001E
#define _USBIENCSR1_AUTORQ_MASK                  0x40000000
#define _USBIENCSR1_AUTORQ_LENGTH                0x00000001

#define _USBIENCSR1_AUTOCLR_POSITION             0x0000001F
#define _USBIENCSR1_AUTOCLR_MASK                 0x80000000
#define _USBIENCSR1_AUTOCLR_LENGTH               0x00000001

#define _USBIENCSR1_OVERRUN_POSITION             0x00000012
#define _USBIENCSR1_OVERRUN_MASK                 0x00040000
#define _USBIENCSR1_OVERRUN_LENGTH               0x00000001

#define _USBIENCSR1_DATAERR_POSITION             0x00000013
#define _USBIENCSR1_DATAERR_MASK                 0x00080000
#define _USBIENCSR1_DATAERR_LENGTH               0x00000001

#define _USBIENCSR1_SENDSTALL_POSITION           0x00000015
#define _USBIENCSR1_SENDSTALL_MASK               0x00200000
#define _USBIENCSR1_SENDSTALL_LENGTH             0x00000001

#define _USBIENCSR1_SENTSTALL_POSITION           0x00000016
#define _USBIENCSR1_SENTSTALL_MASK               0x00400000
#define _USBIENCSR1_SENTSTALL_LENGTH             0x00000001

#define _USBIENCSR1_DISNYET_POSITION             0x0000001C
#define _USBIENCSR1_DISNYET_MASK                 0x10000000
#define _USBIENCSR1_DISNYET_LENGTH               0x00000001

#define _USBIENCSR1_ISO_POSITION                 0x0000001E
#define _USBIENCSR1_ISO_MASK                     0x40000000
#define _USBIENCSR1_ISO_LENGTH                   0x00000001

#define _USBIENCSR2_RXCNT_POSITION               0x00000000
#define _USBIENCSR2_RXCNT_MASK                   0x00003FFF
#define _USBIENCSR2_RXCNT_LENGTH                 0x0000000E

#define _USBIENCSR2_TEP_POSITION                 0x00000010
#define _USBIENCSR2_TEP_MASK                     0x000F0000
#define _USBIENCSR2_TEP_LENGTH                   0x00000004

#define _USBIENCSR2_PROTOCOL_POSITION            0x00000014
#define _USBIENCSR2_PROTOCOL_MASK                0x00300000
#define _USBIENCSR2_PROTOCOL_LENGTH              0x00000002

#define _USBIENCSR2_SPEED_POSITION               0x00000016
#define _USBIENCSR2_SPEED_MASK                   0x00C00000
#define _USBIENCSR2_SPEED_LENGTH                 0x00000002

#define _USBIENCSR2_TXINTERV_POSITION            0x00000018
#define _USBIENCSR2_TXINTERV_MASK                0xFF000000
#define _USBIENCSR2_TXINTERV_LENGTH              0x00000008

#define _USBIENCSR3_TEP_POSITION                 0x00000000
#define _USBIENCSR3_TEP_MASK                     0x0000000F
#define _USBIENCSR3_TEP_LENGTH                   0x00000004

#define _USBIENCSR3_PROTOCOL_POSITION            0x00000004
#define _USBIENCSR3_PROTOCOL_MASK                0x00000030
#define _USBIENCSR3_PROTOCOL_LENGTH              0x00000002

#define _USBIENCSR3_SPEED_POSITION               0x00000006
#define _USBIENCSR3_SPEED_MASK                   0x000000C0
#define _USBIENCSR3_SPEED_LENGTH                 0x00000002

#define _USBIENCSR3_RXINTERV_POSITION            0x00000008
#define _USBIENCSR3_RXINTERV_MASK                0x0000FF00
#define _USBIENCSR3_RXINTERV_LENGTH              0x00000008

#define _USBIENCSR3_TXFIFOSZ_POSITION            0x00000018
#define _USBIENCSR3_TXFIFOSZ_MASK                0x0F000000
#define _USBIENCSR3_TXFIFOSZ_LENGTH              0x00000004

#define _USBIENCSR3_RXFIFOSZ_POSITION            0x0000001C
#define _USBIENCSR3_RXFIFOSZ_MASK                0xF0000000
#define _USBIENCSR3_RXFIFOSZ_LENGTH              0x00000004

#define _USBFIFO0_DATA_POSITION                  0x00000000
#define _USBFIFO0_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO0_DATA_LENGTH                    0x00000020

#define _USBFIFO1_DATA_POSITION                  0x00000000
#define _USBFIFO1_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO1_DATA_LENGTH                    0x00000020

#define _USBFIFO2_DATA_POSITION                  0x00000000
#define _USBFIFO2_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO2_DATA_LENGTH                    0x00000020

#define _USBFIFO3_DATA_POSITION                  0x00000000
#define _USBFIFO3_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO3_DATA_LENGTH                    0x00000020

#define _USBFIFO4_DATA_POSITION                  0x00000000
#define _USBFIFO4_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO4_DATA_LENGTH                    0x00000020

#define _USBFIFO5_DATA_POSITION                  0x00000000
#define _USBFIFO5_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO5_DATA_LENGTH                    0x00000020

#define _USBFIFO6_DATA_POSITION                  0x00000000
#define _USBFIFO6_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO6_DATA_LENGTH                    0x00000020

#define _USBFIFO7_DATA_POSITION                  0x00000000
#define _USBFIFO7_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO7_DATA_LENGTH                    0x00000020

#define _USBOTG_SESSION_POSITION                 0x00000000
#define _USBOTG_SESSION_MASK                     0x00000001
#define _USBOTG_SESSION_LENGTH                   0x00000001

#define _USBOTG_HOSTREQ_POSITION                 0x00000001
#define _USBOTG_HOSTREQ_MASK                     0x00000002
#define _USBOTG_HOSTREQ_LENGTH                   0x00000001

#define _USBOTG_HOSTMODE_POSITION                0x00000002
#define _USBOTG_HOSTMODE_MASK                    0x00000004
#define _USBOTG_HOSTMODE_LENGTH                  0x00000001

#define _USBOTG_VBUS_POSITION                    0x00000003
#define _USBOTG_VBUS_MASK                        0x00000018
#define _USBOTG_VBUS_LENGTH                      0x00000002

#define _USBOTG_LSDEV_POSITION                   0x00000005
#define _USBOTG_LSDEV_MASK                       0x00000020
#define _USBOTG_LSDEV_LENGTH                     0x00000001

#define _USBOTG_FSDEV_POSITION                   0x00000006
#define _USBOTG_FSDEV_MASK                       0x00000040
#define _USBOTG_FSDEV_LENGTH                     0x00000001

